blog/2022/11/05/is-migrating-from-twitter-to-mastodon-risky/index.html
<!DOCTYPE html>
<html lang="en-us">
  <head>
  <title>Is migrating from Twitter to Mastodon risky? - Katherine Cox-Buday</title>
  <meta charset="utf-8" />
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="author" content="Katherine Cox-Buday" />
  <meta name="keywords" content="twitter, communities" />

  <!-- Mobile support -->
  <meta name="viewport" content="width=device-width, initial-scale=1">

  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <!-- <link rel="stylesheet" href="/media/css/prettify.css" type="text/css"> -->

  <!-- Latest compiled and minified CSS -->
  <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.1/css/bootstrap.min.css">
  <!-- Optional theme -->
  <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.1/css/bootstrap-theme.min.css">
  <!-- Latest compiled and minified JavaScript -->
  <link href="https://maxcdn.bootstrapcdn.com/font-awesome/4.2.0/css/font-awesome.min.css" rel="stylesheet">
</head>

  <body>
    <div class="container">
      <div class="row">
        <div class="col-sm-9 blog-main">
          <div class="post">
  <div class="col-sm-3 right-align post-meta">
    <h3>&nbsp;<!-- Placeholder for alignment with post --></h3>
  </div>
  <div class="col-sm-9">
    <div class="post">
      <h3>Is migrating from Twitter to Mastodon risky?</h3>
      <div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org00ad441">Your provider could read your DMs and private posts!</a></li>
<li><a href="#orge192597">Your provider can just delete your account!</a></li>
<li><a href="#org112733b">Your provider could get bored and shut everything down! You could lose everything!</a></li>
<li><a href="#org4484377">There's no moderation!</a></li>
<li><a href="#org03710c1">There's too much moderation! Your provider could block an entire instance!</a></li>
<li><a href="#orgdf3efbf">I don't want to be siloed into an instance!</a></li>
</ul>
</div>
</div>
<p>
Apparently I care about this way more than I realized, because here I am with another hot take on Twitter vs. federation/Mastodon, and only four days after my last one. This actually started out as a Toot (a word that irrationally grates on me), but like a lot of writers, I'm prone to rambling, so here we are together, mired in another blog post. Welcome.
</p>

<p>
I'm starting to entertain the possibility that I abandoned social media mostly due to the platforms available, and feeling like my social graph, content, and activity, were being packed up for sale, and not wanting to endure hateful people with uninformed opinions that weren't even their own. Maybe in time I'll be proven wrong, but I don't feel like that's the case over in the fediverse — or at least you have more agency here.
</p>

<div class="org-center">
<p>
⚜
</p>
</div>

<p>
At this point, I'm mostly perusing Twitter to get the <a href="https://activitypub.rocks/">ActivityPub</a> handles for the people I'd like to reconnect with (I plan on closing my account after the election on Nov. 8th), but while over there, I'm still seeing people express concern about federation, and Mastodon in particular — sometimes quite vehemently, as if leaving was some kind of moral failing, or that it is offensive to suggest that <a href="https://en.wikipedia.org/wiki/The_Dark_Tower_(series)">there are other worlds than these</a>.
</p>

<p>
Some of the concerns are so bewildering to me, that — aside from prompting another post — it made me start wondering what people's motivations were for defending the platform so strongly. So far, here are my best guesses:
</p>

<ol class="org-ol">
<li>People who have built careers around their Twitter social graph are scrambling to maintain their graph and trying to convince their followers not to leave.</li>
<li>People who are familiar with (can I say maybe addicted to?) Twitter don't want to face the possibility of change.</li>
<li>People fundamentally misunderstand what Twitter is, and what is possible for social media to be.</li>
</ol>


<p>
There are of course lots of people using Twitter without getting caught up in the goings-on, but they're also not the people emphatically stating that there's nothing like Twitter in the world, and how <i>dare</i> you suggest otherwise.
</p>

<p>
Of the three motivations, only the third is interesting to me, because it's the only one which can be directly addressed with information. The other two are circumstantial, and certainly understandable.
</p>

<p>
So let's get into it: people are giving reasons for why switching over to a federated network, and Mastodon in particular, is a bad idea; here are my opinions on why these are rooted in misunderstanding.
</p>

<div class="org-center">
<p>
⚜
</p>
</div>


<div id="outline-container-org00ad441" class="outline-2">
<h2 id="org00ad441">Your provider could read your DMs and private posts!</h2>
<div class="outline-text-2" id="text-org00ad441">
<p>
This is also possible on Twitter. That so many don't understand this, and that politicians — famously ignorant of technology — seem to heavily use Twitter, worries me.
</p>

<p>
I think the strongest argument that can be made here is that with larger platforms, there are checks on this kind of power: policies, managers, governance teams, and regulations. But if that's your kind of thing, you can just choose a provider with similar <a href="https://mstdn.social/privacy-policy">terms of service</a>, pay <a href="https://masto.host/pricing/">$6/month</a> (less than Twitter's rumored $8/month by the way), or, if you're capable, host your own instance.
</p>
</div>
</div>

<div id="outline-container-orge192597" class="outline-2">
<h2 id="orge192597">Your provider can just delete your account!</h2>
<div class="outline-text-2" id="text-orge192597">
<p>
This is also possible on Twitter. In fact, there's an amusing trend happening right now of people leaving Twitter by making fun of its new owner. Their accounts are summarily suspended.
</p>

<p>
If you're concerned that your provider's admins are particular vindictive, or impulsive, migrate to a provider you're more comfortable with.
</p>
</div>
</div>

<div id="outline-container-org112733b" class="outline-2">
<h2 id="org112733b">Your provider could get bored and shut everything down! You could lose everything!</h2>
<div class="outline-text-2" id="text-org112733b">
<p>
Like Google+, Vine, <a href="https://en.wikipedia.org/wiki/List_of_defunct_social_networking_services">etc.</a>? Large, monolithic, platforms are not immune to this.
</p>

<p>
Mastodon has robust <a href="https://docs.joinmastodon.org/user/moving/#migration">migration capabilities</a>, and no incentive to dissuade users from using it. If you're using a smaller provider, and you're concerned about its staying power, find a larger provider that's unlikely to shutdown without notice.
</p>

<p>
But I think you should be comfortable even with the smaller providers. In my years of participating in communities around the internet, it's been my experience that administrators of smaller communities are no less considerate than companies when deciding to wind things down, often feel guilty for doing so, and try to give their community a lot of warning.
</p>

<p>
Generally speaking, people taking on the administrative burden of hosting a small community are doing so out of love and passion for the community they're participating in.
</p>

<p>
Still not convinced? Like any data you value, keep backups. You can <a href="https://docs.joinmastodon.org/user/moving/#export">export</a> all of your data, at any time.
</p>
</div>
</div>

<div id="outline-container-org4484377" class="outline-2">
<h2 id="org4484377">There's no moderation!</h2>
<div class="outline-text-2" id="text-org4484377">
<p>
This is plainly false. Provider administrators are doing plenty of moderation, including blocking providers which serve host to hateful, extremist, communities.
</p>

<p>
One of the benefits of the federated model is that, in addition to having agency over what you personally see, you might join a provider which carries a torch for a specific cohort you identify with. Not only can they keep your experience with others using the same provider friendly, they can take action against other providers which have demonstrated that they are acting in bad faith.
</p>

<p>
Lots of distributed communities are grappling with this at the moment, but my favorite take on this comes from <a href="https://element.io/blog/moderation-needs-a-radical-change/">Matrix</a> (another federated platform): a bottom-up, federated, moderation platform with plenty of knobs for folks to turn to get things right for smaller groups of people.
</p>

<p>
Finally, without belittling the hard work moderation teams at companies do, I would not hold large social networks like Twitter up as paragons of content moderation by which everything else is measured.
</p>
</div>
</div>

<div id="outline-container-org03710c1" class="outline-2">
<h2 id="org03710c1">There's too much moderation! Your provider could block an entire instance!</h2>
<div class="outline-text-2" id="text-org03710c1">
<p>
Unless you're using a provider which is overzealous, as stated in the last point, I think this is a good thing. If you feel they're casting too wide a net (can you guess it?), migrate to a different provider.
</p>
</div>
</div>

<div id="outline-container-orgdf3efbf" class="outline-2">
<h2 id="orgdf3efbf">I don't want to be siloed into an instance!</h2>
<div class="outline-text-2" id="text-orgdf3efbf">
<p>
Let me see if I understand this: you fear not being able to interact with people regardless of where they choose to spend their time, and your solution is&#x2026; to use a platform that people must join to interact with you?
</p>

<p>
I think the strongest argument that can be made here is that yes, Twitter is a silo, but it's a really <i>big</i> silo! OK, but then why not make the big silo a <i>really</i> big provider of a federated platform? Like Gmail is for email.
</p>

<p>
Most likely, this is just a fundamental misunderstanding of the federated model. That's understandable when most people have been primarily exposed to the walled gardens of the past two decades.
</p>

<div class="org-center">
<p>
⚜
</p>
</div>

<p>
So why am I suddenly shilling for Mastodon; does any of this really matter?
</p>

<p>
Yes, and no. Insofar as <a href="https://en.wikipedia.org/wiki/Absurdism">anything can have meaning</a>, there are certainly <a href="https://www.charitynavigator.org/discover-charities/where-to-give/ukranian-crisis/">more</a> <a href="https://transequality.org/action-centers">important</a> <a href="https://www.charitynavigator.org/discover-charities/where-to-give/voting-rights/">issues</a> to focus on, but to rephrase what I said in my last post, for better or worse, humanity has invented and uses social media, and a lot of other important issues are affected by what happens there. So yeah, it kind of does matter.
</p>

<p>
And besides, wouldn't it be nice to claw back some agency from the ads and algorithms? We could have nice things, dear reader. Not perfect, but nice.
</p>
</div>
</div>

    </div>
  </div>
</div> <!-- /.container -->

        </div> <!-- /.blog-main -->
        <div class="col-sm-3 blog-sidebar">
          <div class="sidebar-module sidebar-module-inset">
  <a href="/"><span class="fa fa-home fa-2x"></span></a>
  <a href="/rss.xml"><span class="fa fa-rss-square fa-2x"></span></a>
  <a href="/tags/"><span class="fa fa-tags fa-2x"></span></a>
</div>
<div class="sidebar-module">
  <form method="get" id="searchform" action="http://www.google.com/search">
    <input type="text" class="form-control" name="q" id="s" placeholder="Search">
    <input type="hidden" name="q" value="site:katherine.cox-buday.com">
  </form>
</div>
<div class="sidebar-module">
  <h4>Categories</h4>
  <ol class="list-unstyled">
    <li><a href="/blog/">Blog</a></li>
    <li><a href="/concurrency-in-go/">Concurrency in Go</a></li>
    <li><a href="/talks/">Talks</a></li>
    <!-- <li><a href="https://github.com/kelvinh/org-page">GitHub</a></li> -->
  </ol>
</div>
        </div> <!-- /.blog-sidebar -->
      </div> <!-- /.row -->
    </div> <!-- /.container -->
    <script src="//code.jquery.com/jquery-latest.min.js"></script>
<script src="//maxcdn.bootstrapcdn.com/bootstrap/3.3.1/js/bootstrap.min.js"></script>
<script src="https://google-code-prettify.googlecode.com/svn/loader/prettify.js"></script>
<script src="/media/js/main.js"></script>
<!-- HTML5 shim and Respond.js for IE8 support of HTML5 elements and media queries -->
<!--[if lt IE 9]>
    <script src="https://oss.maxcdn.com/html5shiv/3.7.2/html5shiv.min.js"></script>
    <script src="https://oss.maxcdn.com/respond/1.4.2/respond.min.js"></script>
<![endif]-->
<div class="container">
  <script type="text/javascript">
    $('.post-meta').append('<ul class="list-unstyled"><li><span title="post date" class="post-info">2022-11-05</span></li><li><span title="tags" class="post-info"><a href="/tags/opinion/">opinion</a></span></li></ul>');
  </script>
</div> <!-- /.container -->

<footer class="footer">
  <div class="container text-muted">
    <div class="row" style="heigh:2em;">
      <div class="col-md-2 vertical-center">
        <a href="https://github.com/kat-co"><span class="fa fa-github-square fa-2x"></span></a>
        <a href="http://www.linkedin.com/in/katherinecoxbuday"><span class="fa fa-linkedin-square fa-2x"></span></a>
        <a href="https://mstdn.social/@katco"><span class="fa fa-link fa-2x"></span></a>
      </div>
      <div class="col-sm-9 vertical-center">
        Copyright &copy; <a href="mailto:cox &lt;dot&gt; katherine &lt;dot&gt; e &lt;at&gt; gmail &lt;dot&gt; com">Katherine Cox-Buday</a>,
        Generated by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 28.x (<a href="http://orgmode.org">Org mode</a> 9.x) & <a href="https://github.com/kelvinh/org-page" target="_blank">org-page</a>
      </div>
    </div> <!-- ./row -->
  </div> <!-- ./container -->
</footer>

  </body>
</html>
